respuesta cancelacion.xml

respuesta cancelacion
<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><SOAP-ENV:Body><ns1:procesaNotificacionSIS xmlns:ns1="InotificacionSIS" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><XML xsi:type="xsd:string"><![CDATA[<Message><Request Ds_Version=\'0.0\'><Fecha>16/02/2021</Fecha><Hora>17:05</Hora><Ds_SecurePayment>0</Ds_SecurePayment><Ds_Card_Country>999</Ds_Card_Country><Ds_Amount>1</Ds_Amount><Ds_Currency>978</Ds_Currency><Ds_Order>777777761</Ds_Order><Ds_MerchantCode>337884902</Ds_MerchantCode><Ds_Terminal>001</Ds_Terminal><Ds_Response>9915</Ds_Response><Ds_MerchantData></Ds_MerchantData><Ds_TransactionType>38</Ds_TransactionType><Ds_ConsumerLanguage>1</Ds_ConsumerLanguage><Ds_ErrorCode>SIS9915</Ds_ErrorCode><Ds_AuthorisationCode>      </Ds_AuthorisationCode></Request><Signature>HUv4m93fHHTCfaGwutupTIoof11BrG40GDAZ8vAjv34=</Signature></Message>]]></XML></ns1:procesaNotificacionSIS></SOAP-ENV:Body></SOAP-ENV:Envelope>
respuesta de pago
<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><SOAP-ENV:Body><ns1:procesaNotificacionSIS xmlns:ns1="InotificacionSIS" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><XML xsi:type="xsd:string"><![CDATA[<Message><Request Ds_Version=\'0.0\'><Fecha>16/02/2021</Fecha><Hora>17:15</Hora><Ds_SecurePayment>1</Ds_SecurePayment><DS_Card_Type>D</DS_Card_Type><Ds_Card_Country>724</Ds_Card_Country><Ds_Amount>5</Ds_Amount><Ds_Currency>978</Ds_Currency><Ds_Order>555577761</Ds_Order><Ds_MerchantCode>337884902</Ds_MerchantCode><Ds_Terminal>001</Ds_Terminal><Ds_Response>0000</Ds_Response><Ds_MerchantData></Ds_MerchantData><Ds_TransactionType>38</Ds_TransactionType><Ds_ConsumerLanguage>1</Ds_ConsumerLanguage><Ds_AuthorisationCode>141893</Ds_AuthorisationCode><Ds_Card_Brand>2</Ds_Card_Brand><Ds_ProcessedPayMethod>5</Ds_ProcessedPayMethod></Request><Signature>TZYG2eGSfwENfNDbaJQwr4BaU6QcLxgdTfvXw0+RvY8=</Signature></Message>]]></XML></ns1:procesaNotificacionSIS></SOAP-ENV:Body></SOAP-ENV:Envelope>

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><notificacion xmlns="http://notificador.webservice.sis.redsys.es"><datoEntrada><![CDATA[<Message><Request Ds_Version=\'0.0\'><Fecha>16/02/2021</Fecha><Hora>17:17</Hora><Ds_SecurePayment>0</Ds_SecurePayment><Ds_Card_Country>999</Ds_Card_Country><Ds_Amount>5</Ds_Amount><Ds_Currency>978</Ds_Currency><Ds_Order>554577761</Ds_Order><Ds_MerchantCode>337884902</Ds_MerchantCode><Ds_Terminal>001</Ds_Terminal><Ds_Response>9915</Ds_Response><Ds_MerchantData></Ds_MerchantData><Ds_TransactionType>38</Ds_TransactionType><Ds_ConsumerLanguage>1</Ds_ConsumerLanguage><Ds_ErrorCode>SIS9915</Ds_ErrorCode><Ds_AuthorisationCode>      </Ds_AuthorisationCode></Request><Signature>tCFjYuXY5/LaxGvX5YUZOEAQQ7DvsaiWG24mI9q9W1Y=</Signature></Message>]]></datoEntrada></notificacion></soapenv:Body></soapenv:Envelope>

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><notificacion xmlns="http://notificador.webservice.sis.redsys.es"><datoEntrada><![CDATA[<            >]]></datoEntrada></notificacion></soapenv:Body></soapenv:Envelope>
