test/soap-notification/data/notification-1.1.json

{
  "headers": {
    "Content-Type": "text/xml; charset=utf-8",
    "SOAPAction": "urn:InotificacionSIS#procesaNotificacionSIS"
  },
  "body": "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soapenc=\"http://schemas.xmlsoap.org/soap/encoding/\" xmlns:tns=\"https://sis.sermepa.es/sis/InotificacionSIS.wsdl\" xmlns:types=\"https://sis.sermepa.es/sis/InotificacionSIS.wsdl/encodedTypes\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body soap:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"><q1:procesaNotificacionSIS xmlns:q1=\"InotificacionSIS\"><XML xsi:type=\"xsd:string\">&lt;Message&gt;&lt;Request Ds_Version=&quot;0.0&quot;&gt;&lt;Fecha&gt;01/04/2003&lt;/Fecha&gt;&lt;Hora&gt;16:57&lt;/Hora&gt;&lt;Ds_SecurePayment&gt;1&lt;/Ds_SecurePayment&gt;&lt;Ds_Amount&gt;345&lt;/Ds_Amount&gt;&lt;Ds_Currency&gt;978&lt;/Ds_Currency&gt;&lt;Ds_Order&gt;165446&lt;/Ds_Order&gt;&lt;Ds_Card_Type&gt;C&lt;/Ds_Card_Type&gt;&lt;Ds_MerchantCode&gt;999008881&lt;/Ds_MerchantCode&gt;&lt;Ds_Terminal&gt;001&lt;/Ds_Terminal&gt;&lt;Ds_Card_Country&gt;724&lt;/Ds_Card_Country&gt;&lt;Ds_Response&gt;0000&lt;/Ds_Response&gt;&lt;Ds_MerchantData&gt;Alfombrilla para raton&lt;/Ds_MerchantData&gt;&lt;Ds_TransactionType&gt;1&lt;/Ds_TransactionType&gt;&lt;Ds_ConsumerLanguage&gt;1&lt;/Ds_ConsumerLanguage&gt;&lt;/Request&gt;&lt;Signature&gt;RSOw0q6VSNrs4IOS2sS261JDAOMGeSPR9rGdPaxw+ok=&lt;/Signature&gt;&lt;/Message&gt;</XML></q1:procesaNotificacionSIS></soap:Body></soap:Envelope>"
}
